--
-- PostgreSQL database dump
--

\restrict HWavg2chkCmDIEWRjYj8rfejg6zmX1Gt48Ek932KsoMU0X4dxXYEWftVaYfyy5x

-- Dumped from database version 16.15 (Homebrew)
-- Dumped by pg_dump version 16.15 (Homebrew)

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- Data for Name: hr_department; Type: TABLE DATA; Schema: public; Owner: -
--

COPY public.hr_department (department_id, department_code, department_name_th, department_name_en, parent_department_id, sort_order, is_active, remark, created_at, updated_at) FROM stdin;
2	HR	ฝ่ายทรัพยากรบุคคล	Human Resources	\N	1	t	\N	2026-09-17 11:35:17.454151	2026-09-17 11:35:17.454151
3	ACC	ฝ่ายบัญชีและการเงิน	Accounting & Finance	\N	2	t	\N	2026-09-17 11:35:17.454151	2026-09-17 11:35:17.454151
4	SALE	ฝ่ายขาย	Sales	\N	3	t	\N	2026-09-17 11:35:17.454151	2026-09-17 11:35:17.454151
5	IT	ฝ่ายเทคโนโลยีสารสนเทศ	Information Technology	\N	4	t	\N	2026-09-17 11:35:17.454151	2026-09-17 11:35:17.454151
6	OPS	ฝ่ายปฏิบัติการ	Operations	\N	5	t	\N	2026-09-17 11:35:17.454151	2026-09-17 11:35:17.454151
15	MKT	การตลาด	Marketing	\N	0	t	\N	2026-10-12 10:00:48.939186	2026-10-12 10:01:00.543254
7	SE	รักษาความปลอดภัย	Security	\N	0	t	\N	2026-09-18 13:23:57.493019	2026-10-12 10:01:26.25795
\.


--
-- Data for Name: hr_employee_type; Type: TABLE DATA; Schema: public; Owner: -
--

COPY public.hr_employee_type (employee_type_id, employee_type_code, employee_type_name, is_active, remark, created_at, updated_at) FROM stdin;
2	REGULAR	พนักงานประจำ	t	\N	2026-09-17 11:35:17.477492	2026-09-17 11:35:17.477492
3	CONTRACT	พนักงานสัญญาจ้าง	t	\N	2026-09-17 11:35:17.477492	2026-09-17 11:35:17.477492
4	DAILY	รายวัน	t	\N	2026-09-17 11:35:17.477492	2026-09-17 11:35:17.477492
5	PART_TIME	พาร์ทไทม์	t	\N	2026-09-17 11:35:17.477492	2026-09-17 11:35:17.477492
\.


--
-- Data for Name: hr_position; Type: TABLE DATA; Schema: public; Owner: -
--

COPY public.hr_position (position_id, position_code, position_name_th, position_name_en, position_level, sort_order, is_active, remark, created_at, updated_at) FROM stdin;
2	MGR	ผู้จัดการ	Manager	5	1	t	\N	2026-09-17 11:35:17.476805	2026-09-17 11:35:17.476805
3	SUP	หัวหน้างาน	Supervisor	4	2	t	\N	2026-09-17 11:35:17.476805	2026-09-17 11:35:17.476805
4	SR-STAFF	พนักงานอาวุโส	Senior Staff	3	3	t	\N	2026-09-17 11:35:17.476805	2026-09-17 11:35:17.476805
5	STAFF	พนักงาน	Staff	2	4	t	\N	2026-09-17 11:35:17.476805	2026-09-17 11:35:17.476805
6	JR-STAFF	พนักงานฝึกหัด	Junior Staff	1	5	t	\N	2026-09-17 11:35:17.476805	2026-09-17 11:35:17.476805
7	HR-OFFICER	เจ้าหน้าที่บุคคล	HR Officer	2	6	t	\N	2026-09-17 11:35:17.476805	2026-09-17 11:35:17.476805
8	ACC-OFFICER	เจ้าหน้าที่บัญชี	Accounting Officer	2	7	t	\N	2026-09-17 11:35:17.476805	2026-09-17 11:35:17.476805
9	SALE-EXEC	พนักงานขาย	Sales Executive	2	8	t	\N	2026-09-17 11:35:17.476805	2026-09-17 11:35:17.476805
10	IT-DEV	โปรแกรมเมอร์	Developer	3	9	t	\N	2026-09-17 11:35:17.476805	2026-09-17 11:35:17.476805
11	IT-SUPPORT	เจ้าหน้าที่ไอที	IT Support	2	10	t	\N	2026-09-17 11:35:17.476805	2026-09-17 11:35:17.476805
\.


--
-- Data for Name: hr_employee; Type: TABLE DATA; Schema: public; Owner: -
--

COPY public.hr_employee (employee_id, employee_code, prefix, first_name, last_name, first_name_en, last_name_en, gender, birth_date, national_id, email, phone, address, department_id, position_id, employee_type_id, hire_date, probation_end_date, resign_date, employment_status, profile_image, remark, created_at, updated_at) FROM stdin;
5	EMP002	นาย	กิตติพงษ์	นามสมมติ	\N	\N	ชาย	\N	\N	\N	\N	\N	5	7	2	2024-03-13	2024-06-11	2026-09-02	RESIGNED	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
6	EMP003	นางสาว	อรทัย	นามสมมติ	\N	\N	หญิง	\N	\N	\N	\N	\N	6	6	2	2026-05-15	2026-08-13	\N	ACTIVE	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
8	EMP005	นางสาว	กัลยา	นามสมมติ	\N	\N	หญิง	1978-07-20	8428831082663	employee5@example.com	0882837066	20 ถนนสุขุมวิท กรุงเทพฯ	5	8	2	2025-04-18	2025-07-17	\N	ACTIVE	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
9	EMP006	นาย	ประเสริฐ	นามสมมติ	\N	\N	ชาย	\N	\N	\N	\N	\N	6	6	2	2025-10-12	2026-01-10	\N	ACTIVE	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
10	EMP007	นาย	พีรพัฒน์	นามสมมติ	\N	\N	ชาย	1993-03-09	6174070746119	employee7@example.com	0833914399	165 ถนนสุขุมวิท กรุงเทพฯ	4	11	3	2025-03-15	2025-06-13	\N	ACTIVE	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
12	EMP009	นางสาว	สมหญิง	นามสมมติ	\N	\N	หญิง	\N	\N	\N	\N	\N	4	6	2	2023-12-05	2024-03-04	\N	ACTIVE	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
13	EMP010	นางสาว	พิมพ์ชนก	นามสมมติ	\N	\N	หญิง	1989-09-28	2093207610392	employee10@example.com	0822518786	38 ถนนสุขุมวิท กรุงเทพฯ	3	2	3	2023-10-21	2024-01-19	\N	ACTIVE	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
14	EMP011	นาย	ประเสริฐ	นามสมมติ	\N	\N	ชาย	1976-01-21	6821525263881	employee11@example.com	0878451542	14 ถนนสุขุมวิท กรุงเทพฯ	2	8	3	2025-01-01	2025-04-01	\N	ACTIVE	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
15	EMP012	นาย	ธนวัฒน์	นามสมมติ	\N	\N	ชาย	2000-12-16	7170226327062	employee12@example.com	0894672104	71 ถนนสุขุมวิท กรุงเทพฯ	5	9	2	2026-03-24	2026-06-22	\N	ACTIVE	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
16	EMP013	นางสาว	มณีรัตน์	นามสมมติ	\N	\N	หญิง	\N	\N	\N	\N	\N	2	9	5	2026-04-06	2026-07-05	\N	ACTIVE	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
18	EMP015	นางสาว	พิมพ์ชนก	นามสมมติ	\N	\N	หญิง	1995-11-26	3841430109617	employee15@example.com	0867456055	96 ถนนสุขุมวิท กรุงเทพฯ	5	5	3	2025-04-18	2025-07-17	\N	ACTIVE	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
4	EMP001	นางสาว	กัลยา	นามสมมติ	\N	\N	หญิง	1981-07-23	7320529255310	employee1@example.com	0848512345	65 ถนนสุขุมวิท กรุงเทพฯ	2	7	2	2025-11-10	2026-02-08	\N	PROBATION	\N	\N	2026-09-17 12:50:40.500963	2026-10-19 11:23:49.879915
7	EMP004	นาย	ประเสริฐ	นามสมมติ	\N	\N	ชาย	1991-12-02	1314252691837	employee4@example.com	0890439382	11 ถนนสุขุมวิท กรุงเทพฯ	2	11	2	2025-09-14	2025-12-13	2026-09-15	RESIGNED	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
11	EMP008	นางสาว	ศิริพร	นามสมมติ	\N	\N	หญิง	1997-08-06	8617022598467	employee8@example.com	0824212647	114 ถนนสุขุมวิท กรุงเทพฯ	4	11	2	2024-02-25	2024-05-25	2026-08-15	RESIGNED	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
17	EMP014	นาย	วิชัย	นามสมมติ	\N	\N	ชาย	1994-07-16	5067025376564	employee14@example.com	0816933013	74 ถนนสุขุมวิท กรุงเทพฯ	5	2	2	2024-09-30	2024-12-29	\N	ACTIVE	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
19	EMP016	นาย	วิชัย	นามสมมติ	\N	\N	ชาย	\N	\N	\N	\N	\N	2	11	3	2026-06-30	2026-09-28	\N	PROBATION	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
25	EMP022	นาย	ประเสริฐ	นามสมมติ	\N	\N	ชาย	\N	\N	\N	\N	\N	2	11	2	2024-07-29	2024-10-27	\N	ACTIVE	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
20	EMP017	นาย	ณัฐพล	นามสมมติ	\N	\N	ชาย	1971-12-09	6456190204379	employee17@example.com	0830397207	113 ถนนสุขุมวิท กรุงเทพฯ	3	10	2	2024-12-04	2025-03-04	\N	ACTIVE	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
21	EMP018	นาย	อนุชา	นามสมมติ	\N	\N	ชาย	1974-08-11	6142994040481	employee18@example.com	0890573886	138 ถนนสุขุมวิท กรุงเทพฯ	6	8	2	2024-05-14	2024-08-12	\N	ACTIVE	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
22	EMP019	นาย	สมชาย	นามสมมติ	\N	\N	ชาย	1997-09-28	6980084091374	employee19@example.com	0832572366	159 ถนนสุขุมวิท กรุงเทพฯ	3	5	3	2026-03-03	2026-06-01	\N	ACTIVE	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
23	EMP020	นางสาว	มณีรัตน์	นามสมมติ	\N	\N	หญิง	2001-11-02	6157292509019	employee20@example.com	0863745162	84 ถนนสุขุมวิท กรุงเทพฯ	2	5	3	2023-12-03	2024-03-02	\N	ACTIVE	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
24	EMP021	นาย	กิตติพงษ์	นามสมมติ	\N	\N	ชาย	1990-09-01	1444649609856	employee21@example.com	0850584570	152 ถนนสุขุมวิท กรุงเทพฯ	3	5	2	2024-04-19	2024-07-18	\N	ACTIVE	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
26	EMP023	นาย	สุรชัย	นามสมมติ	\N	\N	ชาย	1999-08-28	9561311943698	employee23@example.com	0841673931	47 ถนนสุขุมวิท กรุงเทพฯ	6	7	2	2024-07-31	2024-10-29	\N	ACTIVE	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
27	EMP024	นาย	ปิยะ	นามสมมติ	\N	\N	ชาย	1986-01-14	3041418454885	employee24@example.com	0877423720	49 ถนนสุขุมวิท กรุงเทพฯ	4	4	2	2025-09-30	2025-12-29	\N	ACTIVE	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
28	EMP025	นาย	ศักดิ์ชัย	นามสมมติ	\N	\N	ชาย	1980-04-08	7610911624628	employee25@example.com	0863680797	172 ถนนสุขุมวิท กรุงเทพฯ	4	10	2	2025-05-24	2025-08-22	\N	ACTIVE	\N	\N	2026-09-17 12:50:40.500963	2026-10-14 09:59:10.339943
\.


--
-- Data for Name: hr_employee_certificate; Type: TABLE DATA; Schema: public; Owner: -
--

COPY public.hr_employee_certificate (certificate_id, employee_id, certificate_name, certificate_no, issued_by, issue_date, expire_date, certificate_file, remark, created_at, updated_at) FROM stdin;
2	23	ISO 9001 Awareness	\N	สถาบันฝึกอบรมกลาง	2025-12-18	\N	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
3	28	First Aid Certificate	\N	สถาบันฝึกอบรมกลาง	2026-05-16	2026-10-03	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
4	21	Microsoft Office Specialist	\N	สถาบันฝึกอบรมกลาง	2026-06-14	2027-10-26	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
5	16	Microsoft Office Specialist	\N	สถาบันฝึกอบรมกลาง	2025-12-12	2028-04-21	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
6	28	Project Management Basics	\N	สถาบันฝึกอบรมกลาง	2025-10-13	\N	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
7	20	Project Management Basics	\N	สถาบันฝึกอบรมกลาง	2025-07-24	\N	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
8	8	ISO 9001 Awareness	\N	สถาบันฝึกอบรมกลาง	2026-01-14	2027-06-07	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
9	23	Safety Training Certificate	\N	สถาบันฝึกอบรมกลาง	2026-04-28	2026-07-15	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
10	4	Project Management Basics	\N	สถาบันฝึกอบรมกลาง	2026-07-27	2028-08-12	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
11	27	ISO 9001 Awareness	\N	สถาบันฝึกอบรมกลาง	2025-10-15	2026-06-30	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
12	5	Digital Marketing Certificate	\N	สถาบันฝึกอบรมกลาง	2025-09-12	2027-09-08	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
13	22	First Aid Certificate	\N	สถาบันฝึกอบรมกลาง	2025-07-13	\N	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
14	15	Safety Training Certificate	\N	สถาบันฝึกอบรมกลาง	2025-11-29	\N	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
15	28	Microsoft Office Specialist	\N	สถาบันฝึกอบรมกลาง	2026-03-29	2027-02-04	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
16	21	Digital Marketing Certificate	\N	สถาบันฝึกอบรมกลาง	2026-04-28	\N	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
\.


--
-- Data for Name: hr_employee_education; Type: TABLE DATA; Schema: public; Owner: -
--

COPY public.hr_employee_education (education_id, employee_id, education_level, degree_name, major_name, faculty_name, institute_name, start_year, graduation_year, gpa, remark, created_at, updated_at) FROM stdin;
2	10	ปริญญาตรี	\N	การจัดการทรัพยากรมนุษย์	\N	มหาวิทยาลัยกรุงเทพ	\N	2567	3.06	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
3	8	ปริญญาโท	\N	การจัดการทรัพยากรมนุษย์	\N	มหาวิทยาลัยเกษตรศาสตร์	\N	2564	3.78	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
4	27	ปริญญาโท	\N	รัฐศาสตร์	\N	มหาวิทยาลัยเกษตรศาสตร์	\N	2565	3.83	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
5	12	ปวส.	\N	วิศวกรรมคอมพิวเตอร์	\N	จุฬาลงกรณ์มหาวิทยาลัย	\N	2561	3.12	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
6	21	ปริญญาตรี	\N	เทคโนโลยีสารสนเทศ	\N	สถาบันเทคโนโลยีพระจอมเกล้า	\N	2563	3.51	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
7	5	ปริญญาโท	\N	การจัดการทรัพยากรมนุษย์	\N	มหาวิทยาลัยรามคำแหง	\N	2563	2.88	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
9	8	ปริญญาโท	\N	การจัดการทรัพยากรมนุษย์	\N	มหาวิทยาลัยเกษตรศาสตร์	\N	2565	3.75	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
10	11	ปริญญาโท	\N	รัฐศาสตร์	\N	มหาวิทยาลัยธรรมศาสตร์	\N	2565	3.14	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
11	18	ปริญญาโท	\N	การตลาด	\N	จุฬาลงกรณ์มหาวิทยาลัย	\N	2564	3.43	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
12	12	ปริญญาโท	\N	การตลาด	\N	มหาวิทยาลัยกรุงเทพ	\N	2561	2.90	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
13	14	ปวส.	\N	บัญชี	\N	จุฬาลงกรณ์มหาวิทยาลัย	\N	2566	2.60	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
14	16	ปวส.	\N	บัญชี	\N	มหาวิทยาลัยเกษตรศาสตร์	\N	2568	3.99	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
15	25	ปริญญาตรี	\N	การตลาด	\N	มหาวิทยาลัยเกษตรศาสตร์	\N	2565	2.90	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
16	23	ปริญญาโท	\N	เทคโนโลยีสารสนเทศ	\N	มหาวิทยาลัยรามคำแหง	\N	2565	2.98	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
17	12	ปริญญาโท	\N	บริหารธุรกิจ	\N	มหาวิทยาลัยกรุงเทพ	\N	2561	2.53	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
18	17	ปริญญาตรี	\N	บัญชี	\N	มหาวิทยาลัยกรุงเทพ	\N	2565	3.92	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
19	19	ปวส.	\N	วิศวกรรมคอมพิวเตอร์	\N	มหาวิทยาลัยธรรมศาสตร์	\N	2565	3.58	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
20	12	ปวส.	\N	วิศวกรรมคอมพิวเตอร์	\N	จุฬาลงกรณ์มหาวิทยาลัย	\N	2563	2.97	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
21	13	ปริญญาตรี	\N	เทคโนโลยีสารสนเทศ	\N	มหาวิทยาลัยเกษตรศาสตร์	\N	2562	3.26	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
22	23	ปวส.	\N	รัฐศาสตร์	\N	มหาวิทยาลัยเกษตรศาสตร์	\N	2565	3.86	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
23	18	ปริญญาโท	\N	บัญชี	\N	สถาบันเทคโนโลยีพระจอมเกล้า	\N	2565	2.67	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
24	14	ปวส.	\N	การจัดการทรัพยากรมนุษย์	\N	มหาวิทยาลัยเกษตรศาสตร์	\N	2564	2.50	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
25	24	ปวส.	\N	เทคโนโลยีสารสนเทศ	\N	มหาวิทยาลัยรามคำแหง	\N	2566	2.81	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
26	17	ปริญญาโท	\N	การตลาด	\N	มหาวิทยาลัยธรรมศาสตร์	\N	2563	3.60	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
27	4	ปริญญาโท	\N	วิศวกรรมคอมพิวเตอร์	\N	จุฬาลงกรณ์มหาวิทยาลัย	\N	2564	3.65	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
28	25	ปวส.	\N	การตลาด	\N	มหาวิทยาลัยกรุงเทพ	\N	2565	3.33	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
29	15	ปริญญาตรี	\N	วิศวกรรมคอมพิวเตอร์	\N	มหาวิทยาลัยรามคำแหง	\N	2565	3.90	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
30	16	ปริญญาตรี	\N	เทคโนโลยีสารสนเทศ	\N	มหาวิทยาลัยกรุงเทพ	\N	2567	3.61	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
31	5	ปริญญาโท	\N	เทคโนโลยีสารสนเทศ	\N	จุฬาลงกรณ์มหาวิทยาลัย	\N	2563	3.58	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
8	4	ปริญญาตรี	\N	วิศวกรรมคอมพิวเตอร์	\N	มหาวิทยาลัยรามคำแหง	\N	2562	2.87	\N	2026-09-17 12:50:40.500963	2026-10-22 10:39:13.394265
\.


--
-- Data for Name: hr_employee_movement; Type: TABLE DATA; Schema: public; Owner: -
--

COPY public.hr_employee_movement (movement_id, employee_id, movement_type, effective_date, old_department_id, new_department_id, old_position_id, new_position_id, old_employee_type_id, new_employee_type_id, old_status, new_status, remark, created_by, created_at, updated_at) FROM stdin;
7	4	HIRE	2025-11-10	\N	2	\N	3	\N	2	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
8	5	HIRE	2024-03-13	\N	5	\N	7	\N	2	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
9	6	HIRE	2026-05-15	\N	5	\N	9	\N	2	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
10	7	HIRE	2025-09-14	\N	6	\N	11	\N	2	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
11	8	HIRE	2025-04-18	\N	5	\N	8	\N	2	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
12	9	HIRE	2025-10-12	\N	4	\N	6	\N	2	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
13	10	HIRE	2025-03-15	\N	4	\N	11	\N	3	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
14	11	HIRE	2024-02-25	\N	3	\N	11	\N	2	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
15	12	HIRE	2023-12-05	\N	4	\N	6	\N	2	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
16	13	HIRE	2023-10-21	\N	3	\N	2	\N	3	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
17	14	HIRE	2025-01-01	\N	2	\N	2	\N	3	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
18	15	HIRE	2026-03-24	\N	5	\N	6	\N	2	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
19	16	HIRE	2026-04-06	\N	3	\N	9	\N	5	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
20	17	HIRE	2024-09-30	\N	5	\N	4	\N	2	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
21	18	HIRE	2025-04-18	\N	5	\N	5	\N	3	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
22	19	HIRE	2026-06-30	\N	2	\N	11	\N	3	\N	PROBATION	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
23	20	HIRE	2024-12-04	\N	3	\N	10	\N	2	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
24	21	HIRE	2024-05-14	\N	6	\N	8	\N	2	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
25	22	HIRE	2026-03-03	\N	3	\N	5	\N	3	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
26	23	HIRE	2023-12-03	\N	2	\N	5	\N	3	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
27	24	HIRE	2024-04-19	\N	3	\N	3	\N	2	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
28	25	HIRE	2024-07-29	\N	2	\N	11	\N	2	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
29	26	HIRE	2024-07-31	\N	6	\N	7	\N	2	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
30	27	HIRE	2025-09-30	\N	4	\N	4	\N	2	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
31	28	HIRE	2025-05-24	\N	4	\N	10	\N	2	\N	ACTIVE	บรรจุพนักงานใหม่ (mock data)	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
32	6	TRANSFER	2026-09-05	5	6	\N	\N	\N	\N	\N	\N	ย้ายแผนกตามความเหมาะสมของงาน	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
33	7	TRANSFER	2026-09-01	6	2	\N	\N	\N	\N	\N	\N	ย้ายแผนกตามความเหมาะสมของงาน	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
34	9	TRANSFER	2026-03-14	4	6	\N	\N	\N	\N	\N	\N	ย้ายแผนกตามความเหมาะสมของงาน	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
35	11	TRANSFER	2026-03-29	3	4	\N	\N	\N	\N	\N	\N	ย้ายแผนกตามความเหมาะสมของงาน	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
36	16	TRANSFER	2026-06-28	3	2	\N	\N	\N	\N	\N	\N	ย้ายแผนกตามความเหมาะสมของงาน	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
37	6	PROMOTION	2026-05-22	\N	\N	9	6	\N	\N	\N	\N	เลื่อนตำแหน่งจากผลงาน	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
38	14	PROMOTION	2026-02-04	\N	\N	2	8	\N	\N	\N	\N	เลื่อนตำแหน่งจากผลงาน	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
39	15	PROMOTION	2026-08-05	\N	\N	6	9	\N	\N	\N	\N	เลื่อนตำแหน่งจากผลงาน	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
40	17	PROMOTION	2026-07-05	\N	\N	4	2	\N	\N	\N	\N	เลื่อนตำแหน่งจากผลงาน	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
41	24	PROMOTION	2026-01-23	\N	\N	3	5	\N	\N	\N	\N	เลื่อนตำแหน่งจากผลงาน	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
42	5	RESIGN	2026-09-02	\N	\N	\N	\N	\N	\N	ACTIVE	RESIGNED	ลาออกเพื่อไปทำงานที่อื่น	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
43	7	RESIGN	2026-09-15	\N	\N	\N	\N	\N	\N	ACTIVE	RESIGNED	ลาออกเพื่อไปทำงานที่อื่น	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
44	11	RESIGN	2026-08-15	\N	\N	\N	\N	\N	\N	ACTIVE	RESIGNED	ลาออกเพื่อไปทำงานที่อื่น	1	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
45	4	STATUS_CHANGE	2026-09-18	\N	\N	\N	\N	\N	\N	ACTIVE	PROBATION	\N	1	2026-09-18 12:59:50.576179	2026-09-18 12:59:50.576179
58	4	PROMOTION	2026-10-19	\N	\N	3	7	\N	\N	\N	\N	\N	1	2026-10-19 11:23:49.879915	2026-10-19 11:23:49.879915
\.


--
-- Data for Name: hr_employee_skill; Type: TABLE DATA; Schema: public; Owner: -
--

COPY public.hr_employee_skill (skill_id, employee_id, skill_name, skill_level, experience_year, remark, created_at, updated_at) FROM stdin;
2	16	PHP Programming	EXPERT	5	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
3	24	การเจรจาต่อรอง	INTERMEDIATE	5	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
4	11	Microsoft Excel	BEGINNER	8	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
5	8	PHP Programming	ADVANCED	10	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
6	19	Microsoft Excel	BEGINNER	3	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
7	25	การบริหารเวลา	BEGINNER	3	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
8	5	PHP Programming	EXPERT	2	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
9	10	ภาษาอังกฤษ	BEGINNER	1	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
10	9	การนำเสนองาน	ADVANCED	7	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
11	27	Microsoft Excel	BEGINNER	9	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
12	21	การเจรจาต่อรอง	INTERMEDIATE	7	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
13	26	Microsoft Excel	EXPERT	3	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
14	18	Microsoft Excel	BEGINNER	6	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
15	27	Microsoft Excel	ADVANCED	7	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
16	27	การนำเสนองาน	INTERMEDIATE	3	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
17	4	PHP Programming	ADVANCED	2	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
18	11	การเจรจาต่อรอง	BEGINNER	5	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
19	11	ภาษาอังกฤษ	EXPERT	2	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
20	7	Microsoft Excel	ADVANCED	3	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
21	24	การนำเสนองาน	BEGINNER	10	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
\.


--
-- Data for Name: hr_employee_training; Type: TABLE DATA; Schema: public; Owner: -
--

COPY public.hr_employee_training (training_id, employee_id, course_name, training_provider, training_type, start_date, end_date, duration, duration_unit, certificate_received, remark, created_at, updated_at) FROM stdin;
2	6	Excel เพื่อการทำงาน	ฝ่ายฝึกอบรมภายใน	\N	2026-05-25	\N	7.00	DAY	t	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
3	10	การบริการลูกค้าอย่างมืออาชีพ	ฝ่ายฝึกอบรมภายใน	\N	2026-08-08	\N	4.00	DAY	t	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
4	13	อบรมความปลอดภัยในการทำงาน	ฝ่ายฝึกอบรมภายใน	\N	2026-02-22	\N	14.00	HOUR	t	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
5	5	ภาวะผู้นำเบื้องต้น	ฝ่ายฝึกอบรมภายใน	\N	2026-02-22	\N	10.00	HOUR	t	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
6	25	อบรมความปลอดภัยในการทำงาน	ฝ่ายฝึกอบรมภายใน	\N	2026-04-14	\N	6.00	HOUR	t	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
7	22	พัฒนาทักษะการขาย	ฝ่ายฝึกอบรมภายใน	\N	2026-04-14	\N	5.00	HOUR	t	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
8	21	Excel เพื่อการทำงาน	ฝ่ายฝึกอบรมภายใน	\N	2026-02-17	\N	14.00	DAY	t	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
9	14	Excel เพื่อการทำงาน	ฝ่ายฝึกอบรมภายใน	\N	2026-05-06	\N	6.00	HOUR	t	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
10	14	กฎหมายแรงงานเบื้องต้น	ฝ่ายฝึกอบรมภายใน	\N	2026-05-27	\N	11.00	DAY	t	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
11	24	การบริการลูกค้าอย่างมืออาชีพ	ฝ่ายฝึกอบรมภายใน	\N	2026-01-11	\N	10.00	DAY	t	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
12	11	การบริการลูกค้าอย่างมืออาชีพ	ฝ่ายฝึกอบรมภายใน	\N	2025-11-17	\N	9.00	DAY	f	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
13	28	การบริการลูกค้าอย่างมืออาชีพ	ฝ่ายฝึกอบรมภายใน	\N	2025-10-26	\N	12.00	HOUR	f	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
14	27	พัฒนาทักษะการขาย	ฝ่ายฝึกอบรมภายใน	\N	2026-03-01	\N	10.00	HOUR	t	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
15	26	ภาวะผู้นำเบื้องต้น	ฝ่ายฝึกอบรมภายใน	\N	2026-06-16	\N	14.00	HOUR	t	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
16	21	การสื่อสารในองค์กร	ฝ่ายฝึกอบรมภายใน	\N	2025-08-17	\N	15.00	DAY	t	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
17	7	การบริการลูกค้าอย่างมืออาชีพ	ฝ่ายฝึกอบรมภายใน	\N	2026-07-19	\N	3.00	HOUR	f	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
18	24	การสื่อสารในองค์กร	ฝ่ายฝึกอบรมภายใน	\N	2026-07-28	\N	2.00	HOUR	f	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
19	26	การสื่อสารในองค์กร	ฝ่ายฝึกอบรมภายใน	\N	2025-09-17	\N	16.00	HOUR	t	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
20	16	กฎหมายแรงงานเบื้องต้น	ฝ่ายฝึกอบรมภายใน	\N	2026-04-26	\N	8.00	HOUR	t	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
21	9	อบรมความปลอดภัยในการทำงาน	ฝ่ายฝึกอบรมภายใน	\N	2025-12-06	\N	13.00	DAY	t	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963
\.


--
-- Data for Name: hr_employee_work_history; Type: TABLE DATA; Schema: public; Owner: -
--

COPY public.hr_employee_work_history (work_history_id, employee_id, company_name, position_name, start_date, end_date, salary, job_description, reason_for_leaving, remark, created_at, updated_at) FROM stdin;
1	4	CT companee	Business Analyst (BA)	\N	2026-07-16	\N	\N	ย้ายบ้าน	\N	2026-10-22 10:40:36.891963	2026-10-22 10:40:54.833907
\.


--
-- Data for Name: hr_leave_type; Type: TABLE DATA; Schema: public; Owner: -
--

COPY public.hr_leave_type (leave_type_id, leave_type_code, leave_type_name, max_days, is_active, created_at, updated_at) FROM stdin;
2	SICK	ลาป่วย	30	t	2026-09-17 11:35:17.477882	2026-09-17 11:35:17.477882
3	PERSONAL	ลากิจ	10	t	2026-09-17 11:35:17.477882	2026-09-17 11:35:17.477882
4	VACATION	ลาพักผ่อน	10	t	2026-09-17 11:35:17.477882	2026-09-17 11:35:17.477882
5	CH	ลาคลอดบุตร	90	t	2026-09-17 22:23:11.806156	2026-09-17 22:23:11.806156
\.


--
-- Data for Name: hr_leave_request; Type: TABLE DATA; Schema: public; Owner: -
--

COPY public.hr_leave_request (leave_request_id, employee_id, leave_type_id, start_date, end_date, total_days, reason, document_status, approved_by, approved_at, remark, created_at, updated_at, created_by) FROM stdin;
2	7	2	2026-09-14	2026-09-19	6.00	ลาไปทำธุระครอบครัว	APPROVED	1	2026-09-17 12:50:40.500963	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963	\N
3	27	3	2026-05-30	2026-06-03	5.00	ไม่สบาย	APPROVED	1	2026-09-17 12:50:40.500963	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963	\N
4	23	2	2025-12-02	2025-12-05	4.00	ลากิจธุระส่วนตัว	REJECTED	1	2026-09-17 12:50:40.500963	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963	\N
5	11	2	2026-02-27	2026-03-03	5.00	ไม่สบาย	APPROVED	1	2026-09-17 12:50:40.500963	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963	\N
6	14	3	2026-07-31	2026-08-03	4.00	ไม่สบาย	CANCELLED	\N	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963	\N
7	13	4	2026-05-06	2026-05-11	6.00	ไม่สบาย	SUBMITTED	\N	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963	\N
8	10	3	2026-02-18	2026-02-19	2.00	ลาพักผ่อนประจำปี	APPROVED	1	2026-09-17 12:50:40.500963	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963	\N
9	15	2	2026-04-12	2026-04-16	5.00	ไม่สบาย	CANCELLED	\N	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963	\N
10	13	3	2026-06-10	2026-06-11	2.00	ลาไปทำธุระครอบครัว	CANCELLED	\N	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963	\N
11	15	2	2026-08-13	2026-08-16	4.00	ลาพักผ่อนประจำปี	DRAFT	\N	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963	\N
12	21	3	2026-07-21	2026-07-25	5.00	ลาไปทำธุระครอบครัว	APPROVED	1	2026-09-17 12:50:40.500963	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963	\N
13	5	2	2026-04-07	2026-04-08	2.00	ลากิจธุระส่วนตัว	REJECTED	1	2026-09-17 12:50:40.500963	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963	\N
14	13	3	2026-01-22	2026-01-24	3.00	ลาพักผ่อนประจำปี	APPROVED	1	2026-09-17 12:50:40.500963	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963	\N
15	11	4	2026-04-05	2026-04-06	2.00	ลาพักผ่อนประจำปี	APPROVED	1	2026-09-17 12:50:40.500963	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963	\N
16	18	4	2026-05-24	2026-05-26	3.00	ลาไปงานแต่งงาน	DRAFT	\N	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963	\N
17	18	4	2026-01-16	2026-01-19	4.00	ลากิจธุระส่วนตัว	CANCELLED	\N	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963	\N
18	23	3	2026-06-16	2026-06-19	4.00	ลากิจธุระส่วนตัว	APPROVED	1	2026-09-17 12:50:40.500963	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963	\N
19	4	3	2026-06-02	2026-06-05	4.00	ลาไปทำธุระครอบครัว	REJECTED	1	2026-09-17 12:50:40.500963	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963	\N
20	9	2	2025-12-01	2025-12-06	6.00	ลาพักผ่อนประจำปี	CANCELLED	\N	\N	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963	\N
21	20	2	2026-06-16	2026-06-19	4.00	ลาพักผ่อนประจำปี	APPROVED	1	2026-09-17 12:50:40.500963	\N	2026-09-17 12:50:40.500963	2026-09-17 12:50:40.500963	\N
22	4	5	2026-09-17	2027-02-21	158.00	\N	APPROVED	1	2026-09-18 12:57:05.424146	\N	2026-09-17 22:24:08.481708	2026-09-18 12:57:05.424146	\N
\.


--
-- Name: hr_department_department_id_seq; Type: SEQUENCE SET; Schema: public; Owner: -
--

SELECT pg_catalog.setval('public.hr_department_department_id_seq', 15, true);


--
-- Name: hr_employee_certificate_certificate_id_seq; Type: SEQUENCE SET; Schema: public; Owner: -
--

SELECT pg_catalog.setval('public.hr_employee_certificate_certificate_id_seq', 16, true);


--
-- Name: hr_employee_education_education_id_seq; Type: SEQUENCE SET; Schema: public; Owner: -
--

SELECT pg_catalog.setval('public.hr_employee_education_education_id_seq', 37, true);


--
-- Name: hr_employee_employee_id_seq; Type: SEQUENCE SET; Schema: public; Owner: -
--

SELECT pg_catalog.setval('public.hr_employee_employee_id_seq', 34, true);


--
-- Name: hr_employee_movement_movement_id_seq; Type: SEQUENCE SET; Schema: public; Owner: -
--

SELECT pg_catalog.setval('public.hr_employee_movement_movement_id_seq', 58, true);


--
-- Name: hr_employee_skill_skill_id_seq; Type: SEQUENCE SET; Schema: public; Owner: -
--

SELECT pg_catalog.setval('public.hr_employee_skill_skill_id_seq', 21, true);


--
-- Name: hr_employee_training_training_id_seq; Type: SEQUENCE SET; Schema: public; Owner: -
--

SELECT pg_catalog.setval('public.hr_employee_training_training_id_seq', 21, true);


--
-- Name: hr_employee_type_employee_type_id_seq; Type: SEQUENCE SET; Schema: public; Owner: -
--

SELECT pg_catalog.setval('public.hr_employee_type_employee_type_id_seq', 5, true);


--
-- Name: hr_employee_work_history_work_history_id_seq; Type: SEQUENCE SET; Schema: public; Owner: -
--

SELECT pg_catalog.setval('public.hr_employee_work_history_work_history_id_seq', 1, true);


--
-- Name: hr_leave_request_leave_request_id_seq; Type: SEQUENCE SET; Schema: public; Owner: -
--

SELECT pg_catalog.setval('public.hr_leave_request_leave_request_id_seq', 27, true);


--
-- Name: hr_leave_type_leave_type_id_seq; Type: SEQUENCE SET; Schema: public; Owner: -
--

SELECT pg_catalog.setval('public.hr_leave_type_leave_type_id_seq', 5, true);


--
-- Name: hr_position_position_id_seq; Type: SEQUENCE SET; Schema: public; Owner: -
--

SELECT pg_catalog.setval('public.hr_position_position_id_seq', 11, true);


--
-- Name: train_users_id_seq; Type: SEQUENCE SET; Schema: public; Owner: -
--

SELECT pg_catalog.setval('public.train_users_id_seq', 18, true);


--
-- PostgreSQL database dump complete
--

\unrestrict HWavg2chkCmDIEWRjYj8rfejg6zmX1Gt48Ek932KsoMU0X4dxXYEWftVaYfyy5x

